test/support/ex_vcr/update_payment_method.json

[
  {
    "request": {
      "body": "customer=test_cus_JIdQjmJcjq",
      "headers": {
        "Accept": "application/json; charset=utf8",
        "Accept-Encoding": "gzip",
        "Authorization": "Bearer random_sk_test_51HZXWAEMShkCsLFnX5gePfEYnt2czwXjNg92lD7cC",
        "Connection": "keep-alive",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "2pr08uvghi1kh9j3ds000246",
        "Stripe-Version": "2019-12-03",
        "User-Agent": "Stripe/v1 stripity-stripe/2019-12-03"
      },
      "method": "post",
      "options": {
        "pool": "Elixir.Stripe.API",
        "with_body": "true"
      },
      "request_body": "",
      "url": "https://api.stripe.com/v1/payment_methods/pm_1IgT1nEMShkCsLFnOd4GdL9I/attach"
    },
    "response": {
      "binary": false,
      "body": "{\n  \"id\": \"pm_1IgT1nEMShkCsLFnOd4GdL9I\",\n  \"object\": \"payment_method\",\n  \"billing_details\": {\n    \"address\": {\n      \"city\": null,\n      \"country\": null,\n      \"line1\": null,\n      \"line2\": null,\n      \"postal_code\": null,\n      \"state\": null\n    },\n    \"email\": null,\n    \"name\": null,\n    \"phone\": null\n  },\n  \"card\": {\n    \"brand\": \"visa\",\n    \"checks\": {\n      \"address_line1_check\": null,\n      \"address_postal_code_check\": null,\n      \"cvc_check\": \"pass\"\n    },\n    \"country\": \"US\",\n    \"exp_month\": 4,\n    \"exp_year\": 2024,\n    \"fingerprint\": \"I1hrHXYeMwNxrzEj\",\n    \"funding\": \"credit\",\n    \"generated_from\": null,\n    \"last4\": \"4242\",\n    \"networks\": {\n      \"available\": [\n        \"visa\"\n      ],\n      \"preferred\": null\n    },\n    \"three_d_secure_usage\": {\n      \"supported\": true\n    },\n    \"wallet\": null\n  },\n  \"created\": 1618484792,\n  \"customer\": \"test_cus_JIdQjmJcjq\",\n  \"livemode\": false,\n  \"metadata\": {\n  },\n  \"type\": \"card\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Thu, 15 Apr 2021 11:27:27 GMT",
        "Content-Type": "application/json",
        "Content-Length": "945",
        "Connection": "keep-alive",
        "access-control-allow-credentials": "true",
        "access-control-allow-methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "access-control-allow-origin": "*",
        "access-control-expose-headers": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
        "access-control-max-age": "300",
        "cache-control": "no-cache, no-store",
        "idempotency-key": "2pr08uvghi1kh9j3ds000246",
        "original-request": "req_vU4DRIT9LU3JtX",
        "request-id": "req_vU4DRIT9LU3JtX",
        "stripe-should-retry": "false",
        "stripe-version": "2019-12-03",
        "x-stripe-c-cost": "0",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains; preload"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "invoice_settings%5Bdefault_payment_method%5D=pm_1IgT1nEMShkCsLFnOd4GdL9I",
      "headers": {
        "Accept": "application/json; charset=utf8",
        "Accept-Encoding": "gzip",
        "Authorization": "Bearer random_sk_test_51HZXWAEMShkCsLFnX5gePfEYnt2czwXjNg92lD7cC",
        "Connection": "keep-alive",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "2pr08v128sn119j3ds0000n8",
        "Stripe-Version": "2019-12-03",
        "User-Agent": "Stripe/v1 stripity-stripe/2019-12-03"
      },
      "method": "post",
      "options": {
        "pool": "Elixir.Stripe.API",
        "with_body": "true"
      },
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/test_cus_JIdQjmJcjq"
    },
    "response": {
      "binary": false,
      "body": "{\n  \"id\": \"test_cus_JIdQjmJcjq\",\n  \"object\": \"customer\",\n  \"address\": null,\n  \"balance\": 0,\n  \"created\": 1618482781,\n  \"currency\": \"inr\",\n  \"default_source\": null,\n  \"delinquent\": false,\n  \"description\": null,\n  \"discount\": null,\n  \"email\": \"akhilesh@gmail.com\",\n  \"invoice_prefix\": \"CE3A0C92\",\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n    \"default_payment_method\": \"pm_1IgT1nEMShkCsLFnOd4GdL9I\",\n    \"footer\": null\n  },\n  \"livemode\": false,\n  \"metadata\": {\n    \"id\": \"1\",\n    \"name\": \"Glific\"\n  },\n  \"name\": \"AkhileshNegi\",\n  \"next_invoice_sequence\": 1,\n  \"phone\": null,\n  \"preferred_locales\": [\n\n  ],\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/test_cus_JIdQjmJcjq/sources\"\n  },\n  \"subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"sub_JJ5CY49PhuCN3b\",\n        \"object\": \"subscription\",\n        \"application_fee_percent\": null,\n        \"billing_cycle_anchor\": 1619827200,\n        \"billing_thresholds\": null,\n        \"cancel_at\": null,\n        \"cancel_at_period_end\": false,\n        \"canceled_at\": null,\n        \"collection_method\": \"charge_automatically\",\n        \"created\": 1618484795,\n        \"current_period_end\": 1619827200,\n        \"current_period_start\": 1618484795,\n        \"customer\": \"test_cus_JIdQjmJcjq\",\n        \"days_until_due\": null,\n        \"default_payment_method\": null,\n        \"default_source\": null,\n        \"default_tax_rates\": [\n\n        ],\n        \"discount\": null,\n        \"ended_at\": null,\n        \"items\": {\n          \"object\": \"list\",\n          \"data\": [\n            {\n              \"id\": \"si_JJ5C8tTC56KiCW\",\n              \"object\": \"subscription_item\",\n              \"billing_thresholds\": null,\n              \"created\": 1618484796,\n              \"metadata\": {\n              },\n              \"plan\": {\n                \"id\": \"price_1IfMurEMShkCsLFnO3hoNK1c\",\n                \"object\": \"plan\",\n                \"active\": true,\n                \"aggregate_usage\": null,\n                \"amount\": 750000,\n                \"amount_decimal\": \"750000\",\n                \"billing_scheme\": \"per_unit\",\n                \"created\": 1618222969,\n                \"currency\": \"inr\",\n                \"interval\": \"month\",\n                \"interval_count\": 1,\n                \"livemode\": false,\n                \"metadata\": {\n                },\n                \"nickname\": \"Monthly\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"tiers\": null,\n                \"tiers_mode\": null,\n                \"transform_usage\": null,\n                \"trial_period_days\": null,\n                \"usage_type\": \"licensed\"\n              },\n              \"price\": {\n                \"id\": \"price_1IfMurEMShkCsLFnO3hoNK1c\",\n                \"object\": \"price\",\n                \"active\": true,\n                \"billing_scheme\": \"per_unit\",\n                \"created\": 1618222969,\n                \"currency\": \"inr\",\n                \"livemode\": false,\n                \"lookup_key\": null,\n                \"metadata\": {\n                },\n                \"nickname\": \"Monthly\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"recurring\": {\n                  \"aggregate_usage\": null,\n                  \"interval\": \"month\",\n                  \"interval_count\": 1,\n                  \"trial_period_days\": null,\n                  \"usage_type\": \"licensed\"\n                },\n                \"tiers_mode\": null,\n                \"transform_quantity\": null,\n                \"type\": \"recurring\",\n                \"unit_amount\": 750000,\n                \"unit_amount_decimal\": \"750000\"\n              },\n              \"quantity\": 1,\n              \"subscription\": \"sub_JJ5CY49PhuCN3b\",\n              \"tax_rates\": [\n\n              ]\n            },\n            {\n              \"id\": \"si_JJ5CWMfRcIgZap\",\n              \"object\": \"subscription_item\",\n              \"billing_thresholds\": null,\n              \"created\": 1618484796,\n              \"metadata\": {\n              },\n              \"plan\": {\n                \"id\": \"price_1IfNdDEMShkCsLFncPmeG9bn\",\n                \"object\": \"plan\",\n                \"active\": true,\n                \"aggregate_usage\": \"sum\",\n                \"amount\": null,\n                \"amount_decimal\": null,\n                \"billing_scheme\": \"tiered\",\n                \"created\": 1618225719,\n                \"currency\": \"inr\",\n                \"interval\": \"month\",\n                \"interval_count\": 1,\n                \"livemode\": false,\n                \"metadata\": {\n                },\n                \"nickname\": \"Users\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"tiers\": [\n                  {\n                    \"flat_amount\": null,\n                    \"flat_amount_decimal\": null,\n                    \"unit_amount\": 0,\n                    \"unit_amount_decimal\": \"0\",\n                    \"up_to\": 10\n                  },\n                  {\n                    \"flat_amount\": null,\n                    \"flat_amount_decimal\": null,\n                    \"unit_amount\": 15000,\n                    \"unit_amount_decimal\": \"15000\",\n                    \"up_to\": null\n                  }\n                ],\n                \"tiers_mode\": \"graduated\",\n                \"transform_usage\": null,\n                \"trial_period_days\": null,\n                \"usage_type\": \"metered\"\n              },\n              \"price\": {\n                \"id\": \"price_1IfNdDEMShkCsLFncPmeG9bn\",\n                \"object\": \"price\",\n                \"active\": true,\n                \"billing_scheme\": \"tiered\",\n                \"created\": 1618225719,\n                \"currency\": \"inr\",\n                \"livemode\": false,\n                \"lookup_key\": null,\n                \"metadata\": {\n                },\n                \"nickname\": \"Users\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"recurring\": {\n                  \"aggregate_usage\": \"sum\",\n                  \"interval\": \"month\",\n                  \"interval_count\": 1,\n                  \"trial_period_days\": null,\n                  \"usage_type\": \"metered\"\n                },\n                \"tiers_mode\": \"graduated\",\n                \"transform_quantity\": null,\n                \"type\": \"recurring\",\n                \"unit_amount\": null,\n                \"unit_amount_decimal\": null\n              },\n              \"subscription\": \"sub_JJ5CY49PhuCN3b\",\n              \"tax_rates\": [\n\n              ]\n            },\n            {\n              \"id\": \"si_JJ5CykloF3BtIA\",\n              \"object\": \"subscription_item\",\n              \"billing_thresholds\": null,\n              \"created\": 1618484796,\n              \"metadata\": {\n              },\n              \"plan\": {\n                \"id\": \"price_1IfNf2EMShkCsLFnMcNQ0dZZ\",\n                \"object\": \"plan\",\n                \"active\": true,\n                \"aggregate_usage\": \"sum\",\n                \"amount\": null,\n                \"amount_decimal\": null,\n                \"billing_scheme\": \"tiered\",\n                \"created\": 1618225832,\n                \"currency\": \"inr\",\n                \"interval\": \"month\",\n                \"interval_count\": 1,\n                \"livemode\": false,\n                \"metadata\": {\n                },\n                \"nickname\": \"Messages\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"tiers\": [\n                  {\n                    \"flat_amount\": null,\n                    \"flat_amount_decimal\": null,\n                    \"unit_amount\": 0,\n                    \"unit_amount_decimal\": \"0\",\n                    \"up_to\": 250\n                  },\n                  {\n                    \"flat_amount\": null,\n                    \"flat_amount_decimal\": null,\n                    \"unit_amount\": 1000,\n                    \"unit_amount_decimal\": \"1000\",\n                    \"up_to\": 1000\n                  },\n                  {\n                    \"flat_amount\": null,\n                    \"flat_amount_decimal\": null,\n                    \"unit_amount\": 500,\n                    \"unit_amount_decimal\": \"500\",\n                    \"up_to\": null\n                  }\n                ],\n                \"tiers_mode\": \"graduated\",\n                \"transform_usage\": null,\n                \"trial_period_days\": null,\n                \"usage_type\": \"metered\"\n              },\n              \"price\": {\n                \"id\": \"price_1IfNf2EMShkCsLFnMcNQ0dZZ\",\n                \"object\": \"price\",\n                \"active\": true,\n                \"billing_scheme\": \"tiered\",\n                \"created\": 1618225832,\n                \"currency\": \"inr\",\n                \"livemode\": false,\n                \"lookup_key\": null,\n                \"metadata\": {\n                },\n                \"nickname\": \"Messages\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"recurring\": {\n                  \"aggregate_usage\": \"sum\",\n                  \"interval\": \"month\",\n                  \"interval_count\": 1,\n                  \"trial_period_days\": null,\n                  \"usage_type\": \"metered\"\n                },\n                \"tiers_mode\": \"graduated\",\n                \"transform_quantity\": null,\n                \"type\": \"recurring\",\n                \"unit_amount\": null,\n                \"unit_amount_decimal\": null\n              },\n              \"subscription\": \"sub_JJ5CY49PhuCN3b\",\n              \"tax_rates\": [\n\n              ]\n            },\n            {\n              \"id\": \"si_JJ5C8ZnVGK7vQu\",\n              \"object\": \"subscription_item\",\n              \"billing_thresholds\": null,\n              \"created\": 1618484796,\n              \"metadata\": {\n              },\n              \"plan\": {\n                \"id\": \"price_1IfNe9EMShkCsLFnnfPEFO08\",\n                \"object\": \"plan\",\n                \"active\": true,\n                \"aggregate_usage\": \"sum\",\n                \"amount\": null,\n                \"amount_decimal\": null,\n                \"billing_scheme\": \"tiered\",\n                \"created\": 1618225777,\n                \"currency\": \"inr\",\n                \"interval\": \"month\",\n                \"interval_count\": 1,\n                \"livemode\": false,\n                \"metadata\": {\n                },\n                \"nickname\": \"Consulting hours\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"tiers\": [\n                  {\n                    \"flat_amount\": null,\n                    \"flat_amount_decimal\": null,\n                    \"unit_amount\": 300000,\n                    \"unit_amount_decimal\": \"300000\",\n                    \"up_to\": 10\n                  },\n                  {\n                    \"flat_amount\": null,\n                    \"flat_amount_decimal\": null,\n                    \"unit_amount\": 250000,\n                    \"unit_amount_decimal\": \"250000\",\n                    \"up_to\": null\n                  }\n                ],\n                \"tiers_mode\": \"graduated\",\n                \"transform_usage\": null,\n                \"trial_period_days\": null,\n                \"usage_type\": \"metered\"\n              },\n              \"price\": {\n                \"id\": \"price_1IfNe9EMShkCsLFnnfPEFO08\",\n                \"object\": \"price\",\n                \"active\": true,\n                \"billing_scheme\": \"tiered\",\n                \"created\": 1618225777,\n                \"currency\": \"inr\",\n                \"livemode\": false,\n                \"lookup_key\": null,\n                \"metadata\": {\n                },\n                \"nickname\": \"Consulting hours\",\n                \"product\": \"prod_JG5ns5s9yPRiOq\",\n                \"recurring\": {\n                  \"aggregate_usage\": \"sum\",\n                  \"interval\": \"month\",\n                  \"interval_count\": 1,\n                  \"trial_period_days\": null,\n                  \"usage_type\": \"metered\"\n                },\n                \"tiers_mode\": \"graduated\",\n                \"transform_quantity\": null,\n                \"type\": \"recurring\",\n                \"unit_amount\": null,\n                \"unit_amount_decimal\": null\n              },\n              \"subscription\": \"sub_JJ5CY49PhuCN3b\",\n              \"tax_rates\": [\n\n              ]\n            }\n          ],\n          \"has_more\": false,\n          \"total_count\": 4,\n          \"url\": \"/v1/subscription_items?subscription=sub_JJ5CY49PhuCN3b\"\n        },\n        \"latest_invoice\": null,\n        \"livemode\": false,\n        \"metadata\": {\n          \"id\": \"1\",\n          \"name\": \"Glific\"\n        },\n        \"next_pending_invoice_item_invoice\": null,\n        \"pause_collection\": null,\n        \"pending_invoice_item_interval\": null,\n        \"pending_setup_intent\": null,\n        \"pending_update\": null,\n        \"plan\": null,\n        \"quantity\": null,\n        \"schedule\": null,\n        \"start_date\": 1618484795,\n        \"status\": \"active\",\n        \"tax_percent\": null,\n        \"transfer_data\": null,\n        \"trial_end\": null,\n        \"trial_start\": null\n      }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"url\": \"/v1/customers/test_cus_JIdQjmJcjq/subscriptions\"\n  },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/test_cus_JIdQjmJcjq/tax_ids\"\n  }\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Thu, 15 Apr 2021 11:27:27 GMT",
        "Content-Type": "application/json",
        "Content-Length": "13095",
        "Connection": "keep-alive",
        "access-control-allow-credentials": "true",
        "access-control-allow-methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "access-control-allow-origin": "*",
        "access-control-expose-headers": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
        "access-control-max-age": "300",
        "cache-control": "no-cache, no-store",
        "idempotency-key": "2pr08v128sn119j3ds0000n8",
        "original-request": "req_FKsvO7TGloAujT",
        "request-id": "req_FKsvO7TGloAujT",
        "stripe-should-retry": "false",
        "stripe-version": "2019-12-03",
        "x-stripe-c-cost": "0",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains; preload"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]