test/support/ex_vcr/apply_coupon.json

[
  {
    "request": {
      "body": "discounts%5B0%5D%5Bcoupon%5D=TeStpRoMo",
      "headers": {
        "Accept": "application/json; charset=utf8",
        "Accept-Encoding": "gzip",
        "Authorization": "Bearer random_sk_test_51HZXWAEMShkCsLFnX5gePfEYnt2czwXjNg92lD7cC",
        "Connection": "keep-alive",
        "Content-Type": "application/x-www-form-urlencoded",
        "Idempotency-Key": "2psvsreds5ibgp6p5g0005n5",
        "Stripe-Version": "2019-12-03",
        "User-Agent": "Stripe/v1 stripity-stripe/2019-12-03"
      },
      "method": "post",
      "options": {
        "pool": "Elixir.Stripe.API",
        "with_body": "true"
      },
      "request_body": "",
      "url": "https://api.stripe.com/v1/invoiceitems/test_invoice_id"
    },
    "response": {
      "binary": false,
      "body": "{\n  \"id\": \"test_invoice_id\",\n  \"object\": \"invoiceitem\",\n  \"amount\": 0,\n  \"currency\": \"inr\",\n  \"customer\": \"cus_JNwL7CMCZ8mC92\",\n  \"date\": 1619605088,\n  \"description\": \"Glific Basic Plan\",\n  \"discountable\": true,\n  \"discounts\": [\n    \"di_1IlAWLEMShkCsLFnGqlAFQTX\"\n  ],\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {\n    \"id\": \"1\",\n    \"name\": \"Glific\"\n  },\n  \"period\": {\n    \"end\": 1619605088,\n    \"start\": 1619605088\n  },\n  \"plan\": null,\n  \"price\": {\n    \"id\": \"price_1IfMxsEMShkCsLFnZ9K1QdaH\",\n    \"object\": \"price\",\n    \"active\": true,\n    \"billing_scheme\": \"per_unit\",\n    \"created\": 1618223156,\n    \"currency\": \"inr\",\n    \"livemode\": false,\n    \"lookup_key\": null,\n    \"metadata\": {\n    },\n    \"nickname\": \"No Setup\",\n    \"product\": \"prod_JG5ns5s9yPRiOq\",\n    \"recurring\": null,\n    \"tiers_mode\": null,\n    \"transform_quantity\": null,\n    \"type\": \"one_time\",\n    \"unit_amount\": 0,\n    \"unit_amount_decimal\": \"0\"\n  },\n  \"proration\": false,\n  \"quantity\": 1,\n  \"subscription\": null,\n  \"tax_rates\": [\n    {\n      \"id\": \"txr_1IjH4wEMShkCsLFnSIELvS4n\",\n      \"object\": \"tax_rate\",\n      \"active\": true,\n      \"country\": \"IN\",\n      \"created\": 1619153842,\n      \"description\": \"GST\",\n      \"display_name\": \"GST\",\n      \"inclusive\": false,\n      \"jurisdiction\": \"IN\",\n      \"livemode\": false,\n      \"metadata\": {\n      },\n      \"percentage\": 18.0,\n      \"state\": null\n    }\n  ],\n  \"unit_amount\": 0,\n  \"unit_amount_decimal\": \"0\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 28 Apr 2021 10:21:30 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1447",
        "Connection": "keep-alive",
        "access-control-allow-credentials": "true",
        "access-control-allow-methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "access-control-allow-origin": "*",
        "access-control-expose-headers": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
        "access-control-max-age": "300",
        "cache-control": "no-cache, no-store",
        "idempotency-key": "2psvsreds5ibgp6p5g0005n5",
        "original-request": "req_GAubLUJXPgVOUo",
        "request-id": "req_GAubLUJXPgVOUo",
        "stripe-should-retry": "false",
        "stripe-version": "2019-12-03",
        "x-envoy-attempt-count": "1",
        "x-stripe-c-cost": "0",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains; preload"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]